/*
Напишите программу замена элементов массива: положительные элементы замените на соответствующие отрицательные, и наоборот.
[-4, -8, 8, 2] -> [4, 8, -8, -2]
*/

void ConvertArray(int[] arr)
{
    for (int i = 0; i < arr.Length; i++)
    {
        arr[i] = -arr[i];
    }
}

int[] array = { -4, -8, 8, 2 };
Console.WriteLine(string.Join(",", array));
ConvertArray(array);
Console.WriteLine(string.Join(",", array));
